-- ░██████╗░░██████╗░█████╗░███╗░░██╗██╗░█████╗░░░░███╗░░██╗███████╗████████╗
-- ██╔════╝░██╔════╝██╔══██╗████╗░██║██║██╔══██╗░░░████╗░██║██╔════╝╚══██╔══╝
-- ██║░░██╗░╚█████╗░██║░░██║██╔██╗██║██║██║░░╚═╝░░░██╔██╗██║█████╗░░░░░██║░░░
-- ██║░░╚██╗░╚═══██╗██║░░██║██║╚████║██║██║░░██╗░░░██║╚████║██╔══╝░░░░░██║░░░
-- ╚██████╔╝██████╔╝╚█████╔╝██║░╚███║██║╚█████╔╝██╗██║░╚███║███████╗░░░██║░░░
-- ░╚═════╝░╚═════╝░░╚════╝░╚═╝░░╚══╝╚═╝░╚════╝░╚═╝╚═╝░░╚══╝╚══════╝░░░╚═╝░░░
-- 💬 Resource : Gsonic.GlobalSystem By Gsonic Team l https://discord.gg/7JmRrKFmMu
-- ⛔️ Warning: ทรัพยากรนี้ทำมาเพื่อแจก ห้ามจำหน่ายโดยเด็ดขาด

-- ☕ Thanks For Support Script
fx_version 'cerulean'
games { 'rdr3', 'gta5' }
rdr3_warning 'I acknowledge that this is a prerelease build of RedM, and I am aware my resources *will* become incompatible once RedM ships.'

author 'Gsonic & Azael Dev (https://gsonic.net/) (https://www.azael.dev/ )'
description 'GlobalSystem'
version '1.0.0'
url 'https://gsonic.net/GlobalSystem/'

lua54 'yes'

server_scripts {
	"Setting/Setting.lua",
	"Source/Main.Server.lua",
}